{
    "navBarHome": "Work",
    "navBarAbout": "About",
    "navBarContact": "Contact",

    "buttonViewWorks": "View My Works",
    "buttonViewResume": "View Resume",
    "buttonLoading": "Sending...",
    "buttonSendEmail": "Send E-mail",

    "welcome": "Hi there, I am Rin",
    "welcome2": "I am a web developer, whose main objective is to make people's everyday lives easier. I have a taste for continuous learning, problem solving and the comprehension of complex subjects.",

    "about-intro": "As a developer, my main goal is to design experiences that enrich users' daily lives. That's why the user experience must be intuitive and user-centered.",
    "aboutme": "My journey into full-stack development",
    "aboutme2": "began during my studies as a UX designer. I became increasingly curious about the code behind the applications and websites we use daily. Driven by this curiosity, I quickly progressed from experimenting with HTML to developing more complex applications. Inspired by my initial experiences, I was eager to dive deeper into programming.",
    "passion": "What excites me most about development, ",
    "passiontext": "is seeing how my creations interact with users in their everyday lives. My background in technical high school and sound engineering has given me a strong foundation in both analytical thinking and creative problem-solving, skills that I apply to my development work today. This unique blend of design and technical expertise allows me to craft solutions that are not only functional but also user-centered and intuitive.",
    "hobbies": "When I'm not coding, I enjoy music production and writing. I've always been drawn to artistic expression, which is why my main motivation is to build applications that resonate with users on a deeper level, creating experiences that feel personal and meaningful.",

    "contact": "Let's Connect!",
    "contactText": "Feel free to contact me using the form below. Messages will be sent to my mailbox.",
    "emailForm": "E-mail address",
    "emailFormPlaceholder": "name@example.com",
    "fieldLabel": "Your message here"
}