{
    "navBarHome": "Work",
    "navBarAbout": "About",
    "navBarContact": "Contact",

    "buttonViewWorks": "View My Works",
    "buttonViewResume": "View Resume",
    "buttonLoading": "Sending...",
    "buttonSendEmail": "Send E-mail",

    "welcome": "Hi there, I am Rin",
    "welcome2": "I am a Systems Integration, AI, and Network Engineer in the making. My passion lies in creating robust, efficient, and scalable solutions, whether that's writing low-level systems in C and Rust, or integrating complex network and AI systems.",

    "about-intro": "As a developer, my motivation is to help move technilogy forwards and solve complex problems with simple solutions.",
    "aboutme": "💻 While I started as a fullstack developer, specializing in React, Node.js and TypeScript, my current focus has shifted toward:",
    "aboutme2": "- Systems Programming: Diving deep into C and Rust to build reliable, high-performance software.",
    "aboutme3": "- Network Engineering: Exploring the art of connecting systems seamlessly.",
    "aboutme4": "- Artificial Intelligence: Bridging the gap between machine learning principles and practical implementation.",
    "passion": "✨ What sets me apart?",
    "passiontext": "- A blend of high-level web development skills and low-level systems programming expertise.",
    "passiontext2": "- The ability to pivot between building friendly UIs and diving deep into the guts of a system.",
    "hobbies": "📬 Want to collaborate or chat? Let's connect and explore how we can create something amazing together! 🚀",
    "tools": "Tools",
    "skillset": "Skillset",
    "pw": "Prototypes and Wireframes",
    "agile": "Principles of agile development",

    "contact": "Let's Connect!",
    "contact2": "Want to work together or just have a conversation? Send me a message and let's explore the possibilities.",

    
    "appname1": "Blogging Platform",
    "role1": "Fullstack Developer",
    "description1": "A blogging platform integrated into my portfolio, allowing me to share my projects and experiences.",
    "appname2": "Simple Plan",
    "role2": "UX Designer",
    "description2": "Mobile app for concert booking, designed for a local concert venue.",
    "appname3": "Evo11",
    "role3": "UX Designer",
    "description3": "Mobile app + responsive website for transgender and non-binary affirmation.",
    "appname4": "Vanity Vixen",
    "role4": "UX Designer",
    "description4": "Responsive website for makeup and hairstyling tutorials."
}