{
    "navBarHome": "Work",
    "navBarAbout": "About",
    "navBarContact": "Contact",

    "buttonViewWorks": "View My Works",
    "buttonViewResume": "── .✦ View Resume ✦. ──",
    "buttonLoading": "Sending...",
    "buttonSendEmail": "Send E-mail",

    "welcome": "Hi there, I am Rin ฅ^•ﻌ•^ฅ",
    "welcome2": "I am a Systems Integration, AI, and Network Engineer in the making. My passion lies in creating robust, efficient, and scalable solutions, whether that's writing low-level systems in C and Rust, or integrating complex network and AI systems.",

    "about-intro": "As a developer, my motivation is to help move technology forwards and solve complex problems with simple solutions.",
    "aboutme": "⌨⌨⌨ While I started as a fullstack developer, my current focus has shifted toward:",
    "aboutme2": "- Systems Programming: Diving deep into C and Rust to build reliable, high-performance software.",
    "aboutme3": "- Network Engineering: Exploring the art of connecting systems seamlessly.",
    "aboutme4": "- Artificial Intelligence: Bridging the gap between machine learning principles and practical implementation.",
    "passion": "ˏˋ ★ ˎˊ What sets me apart?",
    "passiontext": "- A blend of high-level web development skills and low-level systems programming expertise.",
    "passiontext2": "- The ability to pivot between building friendly UIs and diving deep into the guts of a system.",
    "hobbies": "(っ'-')╮=͟͟͞͞  ✉ Want to collaborate or chat? Let's connect and explore how we can create something amazing together! .°✴₊⁺⊹",
    "tools": "Tools",
    "skillset": "Skillset",
    "pw": "Prototypes and Wireframes",
    "agile": "Principles of agile development",

    "contact": "Let's Connect!",
    "contact2": "Want to work together or just have a conversation? Send me a message and let's explore the possibilities.",

    
    "appname1": "Blogging Platform",
    "role1": "Fullstack Developer",
    "description1": "A blogging platform integrated into my portfolio, allowing me to share my projects and experiences.",
    "appname2": "Simple Plan",
    "role2": "UX Designer",
    "description2": "Mobile app for concert booking, designed for a local concert venue.",
    "appname3": "Evo11",
    "role3": "UX Designer",
    "description3": "Mobile app + responsive website for transgender and non-binary affirmation.",
    "appname4": "Vanity Vixen",
    "role4": "UX Designer",
    "description4": "Responsive website for makeup and hairstyling tutorials.",


    
    "evo11": {
        "project1": "Evo11",
        "subtitle1": "Mobile Application + Responsive Website for Transgender and Non-Binary Affirmation",
        "projecttype1": "UX Design Portfolio Project",
        "theproject1": "The Project ",
        "theproject1-1": "Evo11 is a mobile application aimed at helping transgender individuals who need affirmations and a sense of progress in their daily lives. Its development and research were conducted solely within its community.",
        "theproblematic1": "The Problematic ",
        "theproblematic1-1": "Although there are inclusive resource websites to help transgender individuals learn about the steps of their transition, there is no application to accompany them daily and help them navigate their journey.",
        "theobjective1": "The Objective ",
        "theobjective1-1": "Create a mobile application to help users of this community affirm themselves over time, something that would help them keep track of their small daily progress and victories.",
        "therole1": "My Role ",
        "therole1-1": "Lead UX designer for the mobile application and the responsive website for iOS mobile and PC.",
        "responsabilities1": "My Responsibilities ",
        "responsabilities1-1": "Conducting interviews, creating paper and digital wireframes, low and high fidelity prototypes, conducting usability studies, responsive design, and considering accessibility.",
    
        "userresearch1": "User Research",
        "userresearch1-1": "Before starting the prototypes, I conducted user research within my circle. Finding participants to answer my many questions - aimed at understanding their joys and frustrations, was a real challenge. However, the responses obtained were worth the personal investment.",
        "userresearch1-2": "The people interviewed were at various stages of their transition, with very different types of journeys from one individual to another. But all had steps to anticipate, remember, or needed to know more about.",
        "userresearch1-3": "Whether it was social, medical, or legal affirmation, it could also be difficult to navigate and know the necessary steps of their own journey.",
        
        "q1-1": "1. Exploration of Identity:",
        "q1-1-1": "- How would you describe your gender identity and how has it evolved over time?",
        "q1-1-2": "- Can you share pivotal moments or achievements related to your gender identity?",
        "q1-2": "2. Transition Journey:",
        "q1-2-1": "- Which steps of your transition did you find the most difficult?",
        "q1-2-2": "- Are there specific aspects of the transition process where you would like more support or information?",
        "q1-3": "3. Support System:",
        "q1-3-1": "- Who has been a crucial source of support for you throughout your gender journey?",
        "q1-3-2": "- In what ways do you prefer to receive support from your friends, family, or community?",
        "q1-4": "4. Use of Technology:",
        "q1-4-1": "- Do you currently use any apps or online platforms for support related to your gender identity?",
        "q1-4-2": "- What types of features or resources do you find most useful in these apps?",
        "q1-5": "5. Challenges and Opportunities:",
        "q1-5-1": "- What common challenges do you face in your daily life related to your gender identity?",
        "q1-5-2": "- Are there specific situations where you feel the need for additional validation or affirmation?",
        "q1-6": "6. Affirmation Preferences:",
        "q1-6-1": "- How do you personally seek and receive affirmation and validation of your gender identity?",
        "q1-6-2": "- What types of messages or signs of affirmation bring you the most comfort or support?",
        "q1-7": "7. Community Engagement:",
        "q1-7-1": "- What types of community activities or events help you feel connected and supported in your gender identity?",
        "q1-7-2": "- Are there community events, forums, or support groups that you actively participate in?",
        "q1-8": "8. Privacy and Security Issues:",
        "q1-8-1": "- How important is privacy and security to you when using apps or platforms related to your gender identity?",
        "q1-8-2": "- Are there specific measures or features you would like to see to ensure a secure online space?",
        "q1-9": "9. Intersectionality:",
        "q1-9-1": "- How do other aspects of your identity, such as race, ethnicity, or socioeconomic status, intersect with your experience as a transgender individual?",
        "q1-9-2": "- Are there unique challenges or experiences you face due to these intersections?",
        "q1-10": "10. Future Needs:",
        "q1-10-1": "- What types of resources, services, or support would you like to see developed to better meet your needs as a transgender individual?",
        "q1-10-2": "- Are there specific areas where you think apps or technologies could be improved to better support the transgender community?",
    
        "competitiveaudit1": "Competitive Audit",
        "competitiveaudit1-1": "For this particular audit, I wouldn't really choose the term 'competitive' since the project aims to serve the well-being of my community. It would rather be sources of inspiration. I was able to visit information hub-type pages for my website, and I was able to test existing applications that aim for transgender affirmation.",
        "competitiveaudit1-2": "It was on this occasion that I discovered that there was no such application in French, or available in the European territory.",
    
        "userpersona1": "User Persona",
        "userpersona1-1": "By grouping the results of my initial interviews, I was able to create two personas, Annabelle and Damien. These were personas with different goals, and for the idea of the application and the means I had, Annabelle suited me best.",
    
        "ideation1": "Ideation Process: Crazy Eights and Homepage",
        
        "lowfidelity1": "Low Fidelity Prototypes",
        "lowfidelity1-1": "During the design of the paper wireframe, I thought of a homepage that grouped all the modules in one place. I stuck with this idea when transitioning to the digital format to offer a simple and intuitive interface.",
        "lowfidelity1-2": "Three main modules structure the page:",
        "lowfidelity1-3": "Photo module: Allows pinning inspiring or personal images. The 'Edit' button facilitates their management.",
        "lowfidelity1-4": "Morning routine: A centralized checklist to track daily tasks (hydration, makeup, etc.), with the possibility of customization via 'Edit'.",
        "lowfidelity1-5": "Long-term checklist: Groups medium or long-term goals (e.g., 'Find a job'), displayed horizontally to differentiate them from daily routines.",
        "lowfidelity1-6": "Finally, to add an extra touch of motivation, a section of inspiring quotes ('Daily Quotes') is integrated at the top of the page. This allows starting the day with a positive thought, while reinforcing the warm and personalized aspect of the application.",
        "lowfidelity1-7": "Regarding the remaining screens, simplicity of use was my first priority.",
        "lowfidelity1-8": "I also expected the user to spend most of their time on the homepage, so I decided to keep the design of the other pages much more minimal.",
    
        "usabilitytesting1": "Usability Testing",
        "testtype1": "Test Type ",
        "testtype1-1": "Navigation Test",
        "testplace1": "Location ",
        "testplace1-1": "Nice and Antibes, France",
        "testcandidates1": "Candidates ",
        "testcandidates1-1": "5 people",
        "testlength1": "Duration ",
        "testlength1-1": "1 hour",
    
        "testresults1": "For this study, the low fidelity version of the prototype was tested, helping me determine the necessary revisions to make the application experience more intuitive and pleasant. Here are some findings:",
        "testresults1-1": "Security: Privacy and data security are particularly important among the candidates. The application should be able to operate locally, without data collection and without an internet connection.",
        "testresults1-2": "Continuity: There were continuity issues that were noticed. This can be resolved by using the same form of buttons for similar themes. For example, 'Edit' buttons should be the same color and shape.",
        "testresults1-3": "Simplification: In the low fidelity version, I had included a 'companies' page that allowed applying for jobs. It was preferable to remove it to ensure the simplicity of my app.",
    
        "uikit1": "User Interface Kit",
        "uikit1-1": "Orange represents ongoing tasks and green represents completed tasks.",
        "uikit1-2": "Apart from those, I made a deliberate choice to keep the colors minimal.",
    
        "highfidelity1": "High Fidelity Prototypes",
        "responsive1-pc": "Responsive Website (PC)",
        "responsive1-1": "After completing the high fidelity prototype, I was challenged to also create designs for a responsive website. This is simply a website that adapts to different screen sizes, so it remains ergonomic and easy to read on mobile, tablet, or PC.",
        "responsive1-2": "Since the type of use of my application corresponds more to phones, I decided to see the website as a small corner to promote this mobile app.",
        "responsive1-ios": "Responsive Website (iOS)",
        "responsive1-3": "This prototype shows the final stages of creating a responsive web design, designed to offer clear and intuitive navigation regardless of screen size. The different pages illustrated here (Home, Contact, Info Hub, Our Mission) present a coherent and ergonomic overview for the user, while highlighting the main features of the application.",
        "responsive1-4": "The focus was on a user experience primarily adapted to phones, as the application itself is mainly aimed at mobile use. Each section of the site is designed as a bridge to the application, allowing visitors to discover its objectives, values, and tools.",
    
        "sitemap1": "Sitemap",
    
        "conclusion1": "Conclusion",
        "conclusion1-1": "Impact: I am happy to have been able to complete this project. I think it allowed me to discover new stories, different struggles that were well worth it. This job fascinates me, and I would like to do more projects like this in the future.",
        "conclusion1-2": "What I learned: Maybe more compassion. Having more courage when asking to conduct usability studies. Realizing that my surroundings were much more enthusiastic about this project than I thought. I will bother them for future studies.",
        "conclusion1-3": "In parallel with my UX design studies, I am taking full stack programming and mobile application development courses. I could try to code this project in an iOS application format.",
        "conclusion1-4": "It is possible that there will be updates to enrich the application with content if it is a project I wish to continue.",
        "conclusion1-5": "I can also think of theme ideas. In the 'Settings' tab of the prototype, there is a theme option, and it might be fun to play with other colors or textures."
    },

    "simpleplan": {
        "project2": "Simple Plan",
        "subtitle2": "Mobile Application for Concert Booking for a Local Concert Hall",
        "projecttype2": "UX Design Portfolio Project",
        "theproject2": "The Project ",
        "theproject2-1": "This application is an interface intended for all spectators who are loyal to a local concert venue. It aims to increase their loyalty by offering simplified access to tickets, discovering new artists, and a notification system.",
        "theproblematic2": "The Problematic ",
        "theproblematic2-1": "Music lovers with busy lives want to book their tickets more easily and no longer forget a concert they were looking forward to.",
        "theobjective2": "The Objective ",
        "theobjective2-1": "Design an application that simplifies concert booking and reminds them when it is coming up soon.",
        "therole2": "My Role ",
        "therole2-1": "Lead UX designer for the mobile application.",
        "responsabilities2": "My Responsibilities ",
        "responsabilities2-1": "Conducting interviews, paper and digital wireframing, creating low and high fidelity prototypes, considering accessibility, and iterating on designs.",
    
        "userresearch2": "User Research",
        "userresearch2-1": "To get a better idea of the audience and the features to create for the application, I found six people in my circle to whom I asked a few questions:",
    
        "q2-1": "Do you often plan to attend a concert later, only to forget about it? How does that make you feel?",
        "q2-2": "Do you think these problems (forgetting a plan) can be solved?",
        "q2-3": "What is the main reason you choose not to go to a concert, even if you have all the possibilities to attend?",
        "q2-4": "Do you have favorite concert venues, and do you tend to stay loyal to these places?",
        "q2-5": "How often do you go to concerts? What are the usual motivations that make you attend?",
    
        "results2": "Thanks to the results obtained from these surveys, I was able to identify four pain points.",
        "r2-1": "Busy Schedule: Too busy with their daily lives, users often tend to forget concerts – hence the need for an application to notify them.",
        "r2-2": "Loneliness: Even if they are a fan of the artist in question, a person will strongly hesitate to go to a concert if they are not accompanied. In music, sharing is essential.",
        "r2-3": "Accessibility: Many applications have a color palette that is not sufficiently contrasted, fonts that are too small, or navigation that is too complicated.",
        "r2-4": "Cost of Outings: It's not just the ticket price, but also the cost of travel or on-site consumption that adds up and often demotivates spectators from going to a concert.",
    
        "userpersona2": "User Persona",
        "userpersona2-1": "Based on the surveys and pain points, I was able to imagine two different personas for whom I will adapt my application.",
        "userpersona2-2": "Thus, I present to you Rinko, a young psychology student, wishing to support her favorite musicians despite her busy schedule. I also present to you Angelo, a math teacher with a visual impairment, which does not prevent him from booking and attending concerts.",
        "userpersona2-3": "To address the issues of these two types of users, I decided to develop an accessible and simplified design.",
    
        "usermap2": "User Map",
        "usermap2-1": "To better understand the needs of my users, I created a user map that illustrates the different stages of their journey, from searching for a concert to booking tickets.",
        
        "wireframe2": "Paper Wireframes",
        "wireframe2-1": "It took several iterations before the digital wireframe stage. I started by drawing the screens on paper, focusing on simplicity and accessibility.",
        "wireframe2-2": "My goal was to develop an interface that is clean, easy to use, so that any user can quickly get familiar with it.",
        "wireframe2-3": "Beginning of digital wireframes",
        "wireframe2-4": "Inspired by user research, I was able to stay focused on creating a wireframe that is coherent, easy to use, and has a design with potential for numerous extensions in the future. A geolocation system, artist search by style or alphabetical order, a section for the venue's IT technicians to add new dates, ticket management, contests, and more...",
        "wireframe2-5": "However, I had to restrain myself. For now, I would stick to a ticket booking and registration function, leaving these ideas for future updates. Thus, the homepage focuses on a list of concerts that might interest the spectator.",
        "wireframe2-6": "The digital wireframe for viewing a concert page.",
        "wireframe2-7": "The date, venue, and price are information I deemed necessary to highlight. I added a somewhat unique feature, putting the organizers' profiles at the forefront, just below the concert title. With this, users could easily follow them for future events by these organizations.",
        "wireframe2-8": "The ticket button, seeing this image, I find it too small, and it would be too low to fall right under the hand. Fortunately, I corrected this problem later by increasing the size of this button.",

        "lowfidelity2": "Low Fidelity Prototypes",
        "lowfidelity2-1": "By creating links to navigate through my digital wireframes, I created what is called a low fidelity prototype. The main user journey is that of booking a concert ticket.",
        "lowfidelity2-2": "This was also a prototype that was tested during my very first user survey.",
        "lowfidelity2-3": "An overview of navigation through the prototype.",
        "lowfidelity2-4": "Starting navigation by selecting a date on the homepage. Displaying the date and booking the ticket, confirmation page, and end of journey page, with a button to return to the homepage.",
        
        "usabilitytesting2": "Usability Testing",
        "usabilitytesting2-1": "I was able to conduct two usability studies on my prototype.",
        "usabilitytesting2-2": "The first usability study was conducted to see how candidates navigate the main user flow.",
        "usabilitytesting2-3": "The second usability study, conducted on the high fidelity prototype, revealed aspects to refine.",
        "usabilitytesting2-4": "Participants stated that a payment module was missing after the confirmation page. They also wanted the ability to book multiple tickets in one order.",
        "usabilitytesting2-5": "One candidate in particular mentioned that accessibility indications for disabled people were missing. The 'Validate a ticket' button also needed to be renamed, as this screen appears before the ticket ordering process.",
        "usabilitytesting2-6": "Finally, participants suggested adding a search function for concerts and allowing users to filter results by date, venue, and music genre.",

        "uikit2": "User Interface Kit",
        "uikit2-1": "For the colors, I specifically had the idea of an interface where the color purple plays an important role. For me, it is the color of creativity.",

        "highfidelity2": "High Fidelity Prototypes",
        "highfidelity2-1": "Each event card features an attractive image, the title, and essential details such as seating type. The simple and clean design allows quickly spotting key information while offering a smooth and ergonomic experience.",
        "highfidelity2-2": "The navigation bar at the bottom of the screen provides quick access to important sections, such as tickets, notifications, and user profile.",

        "conclusion2": "Conclusion and Next Steps",
        "conclusion2-1": "Impact: This application will benefit both concert organizers and users. During the second usability study, most candidates wanted to use it again in a real situation.",
        "conclusion2-2": "What I learned: With this project, I was able to learn all the essential steps in designing an application. I initially created my application based on my own experiences, but I later learned to adapt this project to facilitate its use for other people.",
        "conclusion2-3": "More compatibility with screen readers and tests with visually impaired people, so the application allows access to concerts for everyone.",
        "conclusion2-4": "A messaging module to allow spectators to get to know each other and make plans before meeting at the concert venue.",
        "conclusion2-5": "After completing the high fidelity prototype and usability studies, I tried to imagine some additional capabilities for a potential version 2.0. These are some ideas I had at the beginning of the app's design."
    },
    "vanityvixen": {
        "project3": "Vanity Vixen",
        "subtitle3": "Responsive Website for Makeup and Hairstyling Tutorials",
        "subtitle3-1": "UX Design Portfolio Project",
        "theproject3": "The Project ",
        "theproject3-1": "Vanity Vixen is a site specially designed for makeup tutorials. It is intended for users of all types, regardless of gender or skill level. The goal is to offer looks for everyday wear, as well as more extravagant looks for special occasions.",
        "theproblematic3": "The Problematic ",
        "theproblematic3-1": "There are many makeup tutorials on YouTube, but it is easy for users to get distracted or procrastinate due to the sheer amount of content available. Additionally, there is no way for users to track their progress.",
        "theobjective3": "The Objective ",
        "theobjective3-1": "Design a specialized site for makeup tutorials that is user-friendly for beginners, with resources to find products, step-by-step transcriptions, and progress tracking.",
        "therole3": "My Role ",
        "therole3-1": "UX designer for the PC and mobile versions of the website.",
        "responsabilities3": "My Responsibilities ",
        "responsabilities3-1": "Conducting interviews, creating paper and digital wireframes, low and high fidelity prototypes, conducting usability studies, responsive design, and considering accessibility.",
    
        "userresearch3": "User Research",
        "userresearch3-1": "The initial step for creating this prototype was a user survey with five people who were likely to use makeup. I made sure to interview people of different skill levels and genders.",
        "userresearch3-2": "The interview questions were as follows:",

        "q3-1": "How often do you watch makeup tutorials?",
        "q3-2": "Why do you wear makeup / why would you like to learn makeup?",
        "q3-3": "What prevents you from being more consistent with makeup?",
        "q3-4": "What style of makeup do you like to do / would you like to do?",
        "q3-5": "If there was a platform specifically dedicated to makeup tutorials, what features would you like to see?",
    
        "results3": "Thanks to the results obtained from these surveys, I was able to identify four pain points.",
        "r3-1": "Procrastination: Users may lack encouragement or have too many distractions to practice regularly.",
        "r3-2": "Makeup Products: It is difficult, especially for beginners, to know which essential products are ideal to start with.",
        "r3-3": "Accessibility of Tutorials: Tutorials often lack step-by-step transcriptions and links to find the products used.",
        "r3-4": "Community: Interviewees expressed the need for a community to share honest and constructive feedback without judgment.",
    
        "personas3": "Personas",
        "usermap3": "User Journey Map",
        "sitemap3": "Sitemap",
        "sitemap3-1": "Developing a sitemap before moving on to wireframing was a necessity for this project. The prototype I was going to present would focus on the 'Tutorials' section, but I needed to find a way to organize all the future information.",
    
        "wireframe3": "Paper Wireframes",
        "wireframe3-1": "Thanks to the sitemap, I was able to think of different versions of the homepage on paper.",
        "wireframe3-2": "I wanted something that would be fun to navigate for the user, while keeping a focus on the essential: makeup tutorials.",
        "wireframe3-3": "My prototype was first designed for a PC version, then adapted for mobile screen sizes.",

        "lowfidelity3": "Low Fidelity Prototype",
        "lowfidelity3-1": "After creating the paper wireframes, transitioning to a low fidelity prototype was simple. I prioritized ease of use and site clarity, inspired by existing sites like Sephora, Nyx, and MAC cosmetics.",
        "lowfidelity3-2": "To create my low fidelity prototype, I first tried to see what types of links users are more likely to click to navigate through a website. With my user research in hand, I also did my best to ensure my prototype could address the identified pain points.",
    
        "usabilitytesting3": "Usability Studies",
        "testtype3": "Test type ",
        "testtype3-1": "Navigation testing",
        "testplace3": "Place ",
        "testplace3-1": "Nice and Antibes, France",
        "testcandidates3": "Candidates ",
        "testcandidates3-1": "5 people",
        "testlength3": "Length ",
        "testlength3-1": "1 hour",

        "testresults3": "Testing my low fidelity prototype with external people provided valuable insights.",
        "testresults3-1": "Tutorial Page Organization: Similar to a cooking recipe, it was necessary to present the products used before the makeup steps.",
        "testresults3-2": "Product Brands: Users wanted detailed information on each product: shades, brand, price, and the brand's commitment to environmental causes.",
        "testresults3-3": "Inclusivity: The main goal of my project being inclusivity, I should have offered tutorials for men as well from the start.",
        "testresults3-4": "Based on the usability study, I was able to make significant improvements to my website, both the mobile and PC versions. For example, I thought about an attractive color palette and highlighted navigation buttons.",
        "transition3": "To meet user needs, I made sure to add the names and shades of the products referenced in the demonstration videos. On the mobile version, the tab for used products comes before the step-by-step makeup tutorial.",
        "uikit3": "User Interface Kit",

        "highfidelity3": "High Fidelity Prototype (PC)",
        "highfidelity3-1": "The user flow remained unchanged for my new iteration, the changes made were mainly to optimize usability and visual appeal.",
        "highfidelity3-2": "High Fidelity Prototype (Android)",
        "highfidelity3-3": "Working on the mobile version of my site was a high priority from the start. I wanted to offer an identical user experience, whether accessed from a PC or a smartphone.",

        "conclusion3": "Conclusions",
        "conclusion3-1": "Impact: The target users for whom I wanted to design this application mostly stated that they would like to use this kind of site, whether they are complete beginners or advanced.",
        "conclusion3-2": "What I learned: Not being afraid to let my hobbies and personal tastes express themselves through my projects. Always keeping the user and their issues in mind to adequately meet their needs.",
        "conclusion3-3": "Conduct a new usability study on this high fidelity prototype before potentially sending this design to engineers.",
        "conclusion3-4": "Enrich the website with content and fun tools, allowing the user to better track their progress."
    },
    "b": {
        "1": "Blogging Platform",
        "2": "Full Stack Web Application",
        "3": "Autonomous Project",
        "4": "This blogging platform was designed to document my coding journey, share my learnings and successes, and enhance my experience in web development and deployment.",
        
        "5": "Features",
        "6": "User Authentication: The platform allows users to create an account and log in securely using a token refresh system.",
        "7": "Post Management (CRUD): Users can create a new post, view it on their portfolio, edit it later, or delete it. All changes are visible instantly.",
        "8": "Custom Text Editor (Markdown): For creating and editing posts, after trying React Quill, I opted for a simple Markdown text editor, allowing more flexibility and ease of writing, while spending less time debugging.",
        "9": "Responsive Design: The platform automatically adapts to provide an optimal experience, whether on mobile or desktop.",
        "10": "Robust Deployment: I used a custom .htaccess configuration for deployment on an Apache server, ensuring smooth routing and easy updates.",

        "11": "Planned Features",
        "12": "Tags and Categories: To organize posts and allow visitors to filter content according to their interests.",
        "13": "Public/Private Display: A feature to save a draft and publish it later.",
        "14": "Analytics: Track the number of visitors per post or category, and analyze the overall performance of the blog.",
        "15": "Comments: Allow visitors to leave feedback or interact with the author.",
        "16": "Challenges Faced",
        "17": ".htaccess File Configuration: Server routing was particularly complex. For example, I encountered white screens even though the JavaScript and HTML files were correctly found. I also had to resolve MIME type issues and correctly configure backend request addresses. For more details, you can check this detailed article.",
        "18": "CORS Policies: I implemented a strict CORS policy in the backend to secure API calls from the frontend. I also configured exceptions to allow GET requests from my portfolio.",
        "19": "React Quill Customization: I tried to adapt the editor to add features, such as code block integration, to meet my specific needs. I eventually replaced it with a more minimalist editor.",

        "20": "Architecture Diagram",
        "21": "A diagram illustrating the relationship between the different components of the platform.",
        "22": "Deployment Process",
        "23": "Creating a frontend project with React, TypeScript, and Vite.",
        "24": "Setting up a backend API with Node.js and Express.js.",
        "25": "Configuring an .htaccess file to handle routing and proxies.",
        "26": "Thorough testing on the Apache server (login, post creation, logout, etc.)",
        
        "27": "Screenshots",

        "28": "Code Examples",
        "29": "Text Editor Customization",
        "30": "Backend Controller for Creating a New Post",
        "31": "Lessons Learned",
        "32": "This project allowed me to understand the intricacies of deploying a full-stack application in a professional environment. It also taught me how to solve complex issues related to deployment and server configuration.",
        "33": "Starting with a rudimentary version deployment was a strategic approach, as it allowed me to identify malfunctions in a targeted manner while showing a functional version of the application. Using GitHub to manage backups proved valuable when I had to restore files after errors.",

        "34": "Conclusion",
        "35": "As my development skills improve, this platform will continue to evolve. It will meet my growing needs and represent a showcase of my technical skills. I have confidence in this project because it is not just a coding exercise, but an application I actively use to document my journey and enrich my portfolio."
    }
}