{
    "navBarHome": "Portfolio",
    "navBarAbout": "A propos",
    "navBarContact": "Contact",

    "buttonViewWorks": "Voir Mes Projets",
    "buttonViewResume": "Voir Mon CV",
    "buttonLoading": "Envoi...",
    "buttonSendEmail": "Envoyer l'e-mail",

    "welcome": "Bonjour, je suis Rin",
    "welcome2": "Je suis en train de devenir Ingénieur en Intégration de Systèmes, IA et Réseaux. Ma passion réside dans la création de solutions robustes, efficaces et évolutives, que ce soit en écrivant des systèmes bas-niveau en C et Rust, ou en intégrant des systèmes complexes de réseau et d'IA.",

    "about-intro": "En tant que développeur, ma motivation est de faire avancer la technologie et de résoudre des problèmes complexes avec des solutions simples.",
    "aboutme": "💻 Bien que j'aie commencé comme développeur fullstack, spécialisé en React, Node.js et TypeScript, mon attention actuelle s'est déplacée vers :",
    "aboutme2": "- Programmation Systèmes : Plonger profondément dans C et Rust pour construire des logiciels fiables et performants.",
    "aboutme3": "- Ingénierie Réseau : Explorer l'art de connecter les systèmes de manière transparente.",
    "aboutme4": "- Intelligence Artificielle : Combler le fossé entre les principes de l'apprentissage automatique et leur mise en œuvre pratique.",
    "passion": "✨ Qu'est-ce qui me distingue ?",
    "passiontext": "- Un mélange de compétences en développement web de haut niveau et en programmation systèmes de bas niveau.",
    "passiontext2": "- La capacité de passer de la création d'interfaces utilisateur conviviales à l'exploration des entrailles d'un système.",
    "hobbies": "📬 Vous voulez collaborer ou discuter ? Connectons-nous et explorons comment nous pouvons créer quelque chose d'incroyable ensemble ! 🚀",
    "tools": "Outils",
    "skillset": "Compétences",
    "pw": "Prototypages et Wireframes",
    "agile": "Principes du développement agile",

    "contact": "Connectons-nous!",
    "contact2": "Vous souhaitez travailler avec moi, ou simplement discuter ? Envoyez-moi un message et explorons les possibilités.",

    
    "appname1": "Plateforme de Blogging",
    "role1": "Développeuse Fullstack",
    "description1": "Une plateforme de blogging intégré à mon portfolio, qui me permet de partager mes projets et mes expériences.",
    "appname2": "Simple Plan",
    "role2": "UX Designer",
    "description2": "Application Mobile de réservation de concerts, pour une salle de concert locale.",
    "appname3": "Evo11",
    "role3": "UX Designer",
    "description3": "Application Mobile + Responsive Website pour affirmation transgenre et non-binaire.",
    "appname4": "Vanity Vixen",
    "role4": "UX Designer",
    "description4": "Responsive Website pour des tutoriels de maquillage et de coiffure."
}