{
    "evo11": {
        "project1": "Evo11",
        "subtitle1": "Application Mobile + Responsive Website pour affirmation transgenre et non-binaire",
        "projecttype1": "Projet de Portfolio UX Design",
        "theproject1": "Le Projet ",
        "theproject1.1": "Evo11 est une application mobile ayant pour objectif de venir en aide aux personnes transgenres qui ont besoin d'affirmations et d'un sens de progrès dans leur vie quotidienne. Son développement et sa recherche s'est faite uniquement au sein de sa communauté.",
        "theproblematic1": "La Problématique ",
        "theproblematic1.1": "Bien qu'il existe des sites de ressources inclusifs pour permettre aux personnes transgenres de s'informer des étapes de leur transition,  il n'existe pas d'application pour les accompagner au quotidien et à se repérer dans leur parcours.",
        "theobjective1": "L'Objectif ",
        "theobjective1.1": "Créer une application mobile pour aider les utilisateurs de cette communauté à s'affirmer au cours du temps, quelque chose qui les aideraient à garder une trace de leurs petits progrès et victoires quotidiennes.",
        "therole1": "Mon Rôle ",
        "therole1.1": "Lead UX designer pour l'application mobile, et le responsive website pour mobile iOS et PC.",
        "responsabilities1": "Mes Responsabilités ",
        "responsabilities1.1": "Conduite des interviews, création de wireframes papier et digital, prototypes basse et haute fidélité, conduite des études d'usabilité, responsive design et prise en compte de l'accessibilité.",
    
        "userresearch1": "Recherche Utilisateur",
        "userresearch1.1": "Avant de commencer les prototypes, j'ai mené des recherches utilisateur dans mon entourage. Trouver des participants afin de répondre à mes nombreuses questions - ayant pour objectif de comprendre leurs joies et leurs frustrations, à été un réel défi. Les réponses obtenues ont cependant values l'investissement personnel.",
        "userresearch1.2": "Les personnes interrogés étaient dans des étapes diverses de leur transition, avec des types de parcours très différentes d'un individu à l'autre. Mais tous avaient des étapes à anticiper, à s'en rappeler, où sur lesquels ils avaient besoin d'en savoir plus.",
        "userresearch1.3": "Que ce soit une affirmation sociale, médicale où légale, il pouvait aussi être difficile de se repérer et de connaître les occupations nécessaires de leur propre parcours.",
        
        "q1.1": "1. Exploration de l'identité :",
        "q1.1.1": "- Comment décririez-vous votre identité de genre et comment a-t-elle évolué au fil du temps ?",
        "q1.1.2": "- Pouvez-vous partager des moments ou des réalisations charnières liés à votre identité de genre ?",
        "q1.2": "2. Parcours de transition :",
        "q1.2.1": "- Quelles étapes de votre transition avez-vous trouvées les plus difficiles ?",
        "q1.2.2": "- Y a-t-il des aspects spécifiques du processus de transition sur lesquels vous souhaiteriez avoir plus de soutien ou d'informations ?",
        "q1.3": "3. Système de soutien :",
        "q1.3.1": "- Qui a été une source de soutien cruciale pour vous tout au long de votre parcours en matière de genre ?",
        "q1.3.2": "- De quelles manières préférez-vous recevoir le soutien de vos amis, de votre famille ou de la communauté ?",
        "q1.4": "4. Utilisaton de la technologie :",
        "q1.4.1": "- Utilisez-vous actuellement des applications ou des plateformes en ligne pour obtenir une assistance liée à votre identité de genre ?",
        "q1.4.2": "- Quels types de fonctionnalités ou de ressources trouvez-vous les plus utiles dans ces applications ?",
        "q1.5": "5. Défis et Opportunités :",
        "q1.5.1": "- Quels sont les défis courants auxquels vous êtes confrontés dans votre vie quotidienne liés à votre identité de genre ?",
        "q1.5.2": "- Y a-t-il des situations spécifiques où vous ressentez le besoin d'une validation ou d'une affirmation supplémentaire ?",
        "q1.6": "6. Préférences d'affirmation :",
        "q1.6.1": "- Comment recherchez-vous et recevez-vous personnellement l'affirmation et la validation de votre identité de genre ?",
        "q1.6.2": "- Quels types de messages ou de signes d'affirmation vous apportent le plus de réconfort ou de soutien ?",
        "q1.7": "7. Engagement communautaire :",
        "q1.7.1": "- Quels types d'activités ou d'événements communautaires vous aident à vous sentir connecté et soutenu dans votre identité de genre ?",
        "q1.7.2": "- Y a-t-il des événements communautaires, des forums ou des groupes de soutien auxquels vous participez activement ?",
        "q1.8": "8. Problèmes de confidentialité et de sécurité :",
        "q1.8.1": "- Quelle importance accordez-vous à la confidentialité et à la sécurité lorsque vous utilisez des applications ou des plateformes liées à votre identité de genre ?",
        "q1.8.2": "- Y a-t-il des mesures ou des fonctionnalités spécifiques que vous aimeriez voir pour garantir un espace en ligne sécurisé ?",
        "q1.9": "9. Intersectionnalité :",
        "q1.9.1": "- Comment d'autres aspects de votre identité, tels que la race, l'origine ethnique ou le statut socio-économique, se recoupent-ils avec votre expérience en tant qu'individu transgenre ?",
        "q1.9.2": "- Y a-t-il des défis ou des expériences uniques auxquels vous êtes confrontés en raison de ces intersections ?",
        "q1.10": "10. Besoins futurs :",
        "q1.10.1": "- Quels types de ressources, de services ou de soutien aimeriez-vous voir développés pour mieux répondre à vos besoins en tant qu'individu transgenre ?",
        "q1.10.2": "- Y a-t-il des domaines spécifiques où vous pensez que les applications ou les technologies pourraient être améliorées pour mieux soutenir la communauté transgenre ?",
    
        "competitiveaudit1": "Audit Concurrentiel",
        "competitiveaudit1.1": "Pour cet audit en particulier, je ne choisirais pas réellement le terme 'compétitif' puisque le projet à pour but de servir au bien être de ma communauté. Il s'agirait plutôt de sources d'inspirations. J'ai pu visiter des pages de type hub d'informations pour mon site web, et j'ai pu tester des applications existantes qui visent l'affirmation transgenre.",
        "competitiveaudit1.2": "C'est à cette occasion-mà que j'ai pu découvrir qu'il n'existait pas d'application de ce type en français, où disponible sur le territoire européen.",
    
        "userpersona1": "Persona Utilisateur",
        "userpersona1.1": "En regroupant les résultats de mes interviews initiaux, je fus capable de créer deux personas, Annabelle et Damien. Il s'agissait de personas avec des objectifs différents, et pour l'idée d'application et les moyens que j'avais, c'était Annabelle qui me convenait le mieux.",
    
        "ideation1": "Processus d'idéation: crazy eights et page d'accueil",
        
        "lowfidelity1": "Prototypes Basse Fidélité",
        "lowfidelity1.1": "Durant la conception du wireframe papier, j'ai réfléchi à une page d'accueil regroupant tous les modules en un seul endroit. Je suis resté sur cette idée lors de la transition vers le format digital afin de proposer une interface simple et intuitive.",
        "lowfidelity1.2": "Trois modules principaux structurent la page :",
        "lowfidelity1.3": "Module photos : Permet d'épingler des images inspirantes ou personnelles. Le bouton 'Edit' facilite leur gestion.",
        "lowfidelity1.4": "Routine matinale : Une checklist centralisée pour suivre des tâches quotidiennes (hydratation, maquillage, etc.), avec la possibilité de personnalisation via 'Edit'.",
        "lowfidelity1.5": "Checklist longue durée : Regroupe des objectifs à moyen ou long terme (ex. : 'Trouver un emploi'), affichés horizontalement pour les différencier des routines journalières.",
        "lowfidelity1.6": "Enfin, pour ajouter une touche de motivation supplémentaire, une section de citations inspirantes ('Daily Quotes') est intégrée en haut de la page. Cela permet de démarrer la journée avec une pensée positive, tout en renforçant l'aspect chaleureux et personnalisé de l'application.",
        "lowfidelity1.7": "Concernant les écrans restantes, la simplicité d'utilisation fut ma première priorité.",
        "lowfidelity1.8": "Je m'attendais aussi à ce que l'utilisateur passe la majorité de son temps sur la page d'accueil, décidant donc de garder le design des autres pages beaucoup plus minimaux.",
    
        "usabilitytesting1": "Tests d'Usabilité",
        "testtype1": "Type de Test ",
        "testtype1.1": "Test de navigation",
        "testplace1": "Lieu ",
        "testplace1.1": "Nice et Antibes, France",
        "testcandidates1": "Candidats ",
        "testcandidates1.1": "5 personnes",
        "testlength1": "Durée ",
        "testlength1.1": "1 heure",
    
        "testresults1": "Pour cet étude-ci, la version basse fidélité du prototype fut testé, m'aidant ainsi à déterminer les révisions nécessaires pour rendre l'expérience de l'application plus intuitif et plaisant. Voici quelques trouvailles :",
        "testresults1.1": "Sécurité: La confidentialité et la sécurité des données est particulièrement importante parmi les candidats. Il faudrait que l'application puisse fonctionner en local, sans collecte de données et sans connection internet.",
        "testresults1.2": "Continuité: Il y avait des soucis de continuité qui fut remarquée. Chose qui peut être résolu en utilisant la même forme de boutons pour des thèmes similaires. Par exemple, les boutons 'Edit' devraient être de la même couleur et de la même forme.",
        "testresults1.3": "Simplification: Dans la version basse fidélité, j'avais inclus une page “entreprises” qui permettait de postuler à des emplois. Il était préférable de la supprimer pour garantir la simplicité de mon app.",
    
        "uikit1": "Kit d'Interface Utilisateur",
        "uikit1.1": "L'orange représente les tâches en cours et le vert représente les tâches terminées.",
        "uikit1.2": "A part ceux-là, je fis un choix volontaire de garder les couleurs minimaux.",
    
        "highfidelity1": "Prototypes Haute Fidélité",
        "responsive1-pc": "Responsive Website (PC)",
        "responsive1.1": "Après le prototype haute fidélité terminé, je fus mis au défi de créer également des designs pour un responsive website. Il s'agit simplement d'un site web qui s'adapte aux tailles différents d'écran, pour que ça reste ergonimique facile à lire sur portable, tablette où PC.",
        "responsive1.2": "Puisque le type d'utilisation de mon application correspond davantage aux téléphones, je décidai de voir le site web comme un petit coin pour faire connaître cette mobile app.",
        "responsive1-ios": "Responsive Website (iOS)",
        "responsive1.3": "Ce prototype montre les étapes finales de la création d'un design web responsive, conçu pour offrir une navigation claire et intuitive quelle que soit la taille de l'écran. Les différentes pages illustrées ici (Accueil, Contact, Info Hub, Notre Mission) présentent un aperçu cohérent et ergonomique pour l'utilisateur, tout en mettant en avant les fonctionnalités principales de l'application.",
        "responsive1.4": " L'accent a été mis sur une expérience utilisateur adaptée principalement aux téléphones, puisque l'application elle-même cible avant tout une utilisation mobile. Chaque section du site est pensée comme un pont vers l'application, permettant aux visiteurs de découvrir ses objectifs, ses valeurs, et ses outils.",
    
        "sitemap1": "Plan du Site",
    
        "conclusion1": "Conclusion",
        "conclusion1.1": "Impact: Je suis contente d'avoir pu mener ce projet à bien. Je pense qu'il à pu me faire découvrir des histoires nouvelles, différentes galères qui en valaient bien la peine. Ce métier me passione, je souhaiterais faire davantage de projets comme ceci dans l'avenir.",
        "conclusion1.2": " Ce que j'ai appris: Peut être plus de compassion. Avoir davantage de courage lorsque je demande de faire des études d'usabilité. Se rendre compte que mon entourage était bien plus enthousiaste de ce projet que je ne le pensais. Je les embêterai pour de futurs études.",
        "conclusion1.3": "En parallèle à mes études d'UX design, je suis des cours de programmation full stack et de développement d'application mobile. Je pourrais essayer de coder ce projet dans un format application iOS.",
        "conclusion1.4": "Il est possible qu'il y ait des mises à jour pour enrichir l'application de contenu, si c'est un projet que je souhaite continuer.",
        "conclusion1.5": "Je peux peut être aussi penser à des idées de thèmes. Dans l'onglet “Paramètres” du prototype il y a une option de thèmes, et il serait peut être amusant de jouer avec d'autres couleurs où des textures."
    },

    "simpleplan": {
        "project2": "Simple Plan",
        "subtitle2": "Application Mobile de réservation de concerts, pour une salle de concert locale",
        "projecttype2": "Projet de Portfolio UX Design",
        "theproject2": "Le Projet ",
        "theproject2.1": "Cette application est une interface destinée à tous les spectateurs qui sont fidèles à un lieu de concert local. Elle permet d'augmenter leur fidélité en proposant un accès simplifié aux billets, à la découverte de nouveaux artistes et un système de notification.",
        "theproblematic2": "La Problématique ",
        "theproblematic2.1": "Les amateurs de musique avec une vie active souhaitent réserver leurs billets plus simplement, et ne plus oublier un concert qu'ils anticipaient tant.",
        "theobjective2": "L'Objectif ",
        "theobjective2.1": "Concevoir une application qui simplifie la réservation d'un concert et qui leur rappellera lorsque cela aura lieu prochainement.",
        "therole2": "Mon Rôle ",
        "therole2.1": "Lead UX designer pour l'application mobile.",
        "responsabilities2": "Mes Responsabilités ",
        "responsabilities2.1": "Réalisation d'entretiens, wireframing papier et numérique, créations de prototypes basse et haute fidélité, prise en compte de l'accessibilité et itération sur les conceptions.",
    
        "userresearch2": "Recherche Utilisateur",
        "userresearch2.1": "Pour me faire une meilleure idée du public et des fonctionnalités à créer pour l'application, j'ai trouvé dans mon entourage six personnes auquels j'ai posés quelques questions :",

        "q2.1": "Vous arrive t'il souvent de prévoir un plan pour un concert plus tard, pour l'oublier ensuite? Qu'est ce que cela vous fait ressentir?",
        "q2.2": "Pensez vous que ces problèmes (celui d'oublier un plan) peut être résolu?",
        "q2.3": "Quelle est la raison principale pour laquelle vous choisissez de ne pas aller à un concert, même si vous avez toutes les possibilités pour y participer?",
        "q2.4": "Avez vous des lieux de concert préférés, et avez vous tendance à rester fidèles à ces lieux?",
        "q2.5": "A quel fréquence allez vous au concert? Quels sont généralement les motivations qui vous font venir?",
    
        "results2": "Grâce aux résultats obtenus lors de ces sondages, j'ai pu identifier quatre points de douleur.",
        "r2.1": "Emploi du temps chargé: Trop occupés avec leurs quotidiens, les utilisateurs auront souvent tendance à oublier les concerts –d'où la nécessité d'une application pour les notifier.",
        "r2.2": "Solitude: Même si elle est fan de l'artiste en question, une personne va fortement hésiter à aller à un concert si elle n'est pas accompagnée. Dans la musique, le partage est essentiel.",
        "r2.3": "Accessibilité: Beaucoup d'applications ont une palette de couleurs qui n'est pas suffisamment contrastée, des polices trop petites où une navigation trop compliquée.",
        "r2.4": "Prix des sorties: Il n'y a pas seulement le prix des billets, mais surtout le prix du trajet où des consommations sur place qui alourdissent l'addition et démotivent souvent les spectateurs pour aller à un concert.",
    
        "userpersona2": "Persona Utilisateur",
        "userpersona2.1": "Basé sur les sondages et les points de douleur, j'ai pu imaginer deux types de personas différentes pour qui je vais adapter mon application.",
        "userpersona2.2": "Ainsi, je vous présente Rinko, jeune étudiante en psychologie, souhaitant supporter ses musiciens préférés malgré son emploi de temps chargé. Je vous présente également Angelo, professeur de mathématiques avec une déficience visuelle, qui ne l'empêche pas de réserver et d'aller aux concerts.",
        "userpersona2.3": "Pour répondre aux problématiques de ces deux types d'utilisateurs, j'ai décidé de mettre au point un design accessible et simplifié.",
    
        "usermap2": "Carte Utilisateur",
        "usermap2.1": "Pour mieux comprendre les besoins de mes utilisateurs, j'ai créé une carte utilisateur qui illustre les différentes étapes de leur parcours, de la recherche d'un concert à la réservation de billets.",
        
        "wireframe2": "Wireframes Papier",
        "wireframe2.1": "Il a fallu plusieurs itérations avent l'étape du wireframe digital. J'ai commencé par dessiner les écrans sur papier, en me concentrant sur la simplicité et l'accessibilité.",
        "wireframe2.2": "Mon objectif était de mettre au point une interface qui soit épurée, simple à prendre en main, pour que tout utilisateur puisse s'y familiariser rapidement.",
        
        "wireframe2.3": "Début des wireframes numériques",
        "wireframe2.4": "Inspiré par les recherches utilisateurs j'ai pu rester concentré pour la création d'un wireframe qui soit cohérent, simple d'utilisation et avec un design qui à du potentiel pour des extensions nombreuses dans le futur.  Un système de géolocalisation.. recherche d'artistes par style où dans l'ordre alphabétique.. un côté pour les techniciens informatiques du lieu, pour ajouter de nouvelles dates, la gestion des tickets, des jeux concours et plus...",
        "wireframe2.5": "Cependant je ne devais pas m'emballer. J'allais pour le moment rester sur une fonction de réservation et d'enregistrement de tickets, et laisser ces idées pour des mises à jour futures. Ainsi, la page d'accueil concentre une liste de concerts qui pourraient être intéressantes pour le spectateur.",
        "wireframe2.6": "Le wireframe numérique pour la visualisation d'une page de concert. ",
        "wireframe2.7": "La date, le lieu et le prix sont des informations que j'estimais nécessaires de mettre en évidence. J'avais rajoutée une fonction un peu inédite, mettre les profils des organisateurs en premier plan, juste en-dessous du titre du concert. Avec ceci les utilisateurs pourraient facilement les suivre pour de futures évènements de ces organisations.",
        "wireframe2.8": "Le bouton des tickets, en voyant cette image je la trouve trop petite, et elle serait trop basse pour tomber juste sous la main. Heureusement j'ai corrigé ce problème plus tard, en augmentant la taille de ce bouton.",

        "lowfidelity2": "Prototypes Basse Fidélité",
        "lowfidelity2.1": "En créant des liens pour naviguer à travers mes wireframes numériques, j'ai créé ce que l'on nomme un prototype basse fidélité. Le parcours utilisateur principal est celui de la réservation d'un ticket de concert.",
        "lowfidelity2.2": "Ce fut aussi un prototype qui fut testé lors de ma toute première enquête utilisateur.",
        "lowfidelity2.3": "Un aperçu de la navigation à travers le prototype. ",
        "lowfidelity2.4": "Commencement de la navigation par la sélection d'une date dans la page d'accueil. Affichage de la date et réservation du ticket, page de confirmation et page de fin de parcours, avec un bouton pour revenir sur la page d'accueil.",
    
        "usabilitytesting2": "Tests d'Usabilité",
        "usabilitytesting2.1": "J'ai pu mener deux études d'utilisabilité sur mon prototype. ",
        "usabilitytesting2.2": "La première étude d'utilisabilité a été menée pour voir comment les candidats naviguent dans le flux d'utilisateurs principal. ",
        "usabilitytesting2.3": "La seconde étude d'usabilité, réalisée sur le prototype haute fidélité, a révélé les aspects à affiner.",
        "usabilitytesting2.4": "Les participants ont déclarés qu'il manquait un module de paiement après la page de confirmation. Ils souhaitaient également avoir la possibilité de réserver plusieurs tickets en une seule commande.",
        "usabilitytesting2.5": "Un candidat en particulier à mentionné qu'il manquait des indications d'accessibilité pour les personnes handicapés. Le bouton « Valider un ticket » devait également être renommé, puisque cet écran apparaît avant le processus de commande de billet.",
        "usabilitytesting2.6": "Enfin, les participants ont suggéré d'ajouter une fonction de recherche pour les concerts, et de permettre aux utilisateurs de filtrer les résultats par date, lieu et genre musical.",

        "uikit2": "Kit d'Interface Utilisateur",
        "uikit2.1": "Pour les couleurs, j'eus spécifiquement l'idée d'un interface où la couleur violette occupe une place importante. Pour moi, c'est la couleur de la créativité.",

        "highfidelity2": "Prototypes Haute Fidélité",
        "highfidelity2.1": "Chaque carte d'événement présente une image attrayante, le titre, et des détails essentiels comme le type de placement. Le design simple et épuré permet de repérer rapidement les informations clés, tout en offrant une expérience fluide et ergonomique.",
        "highfidelity2.2": "La barre de navigation en bas de l'écran offre un accès rapide aux sections importantes, telles que les billets, les notifications, et le profil utilisateur.",

        "conclusion2": "Conclusion et prochaines étapes",
        "conclusion2.1": "Impact: Cet application bénéficiera simultanément les organisateurs de concert et les utilisateurs. Lors de la seconde étude d'utilisabilité, la majorité des candidats souhaitaient l'utiliser à nouveau dans une situation réelle.",
        "conclusion2.2": "Ce que j'ai appris: Avec ce projet, j'ai pu apprendre toutes les étapes essentielles lors de la conception d'une application. J'avais d'abord crée mon application en me basant sur mes propres expérience, mais j'ai pu apprendre ensuite à adapter ce projet pour faciliter son utilisation aux autres personnes.",
        "conclusion2.3": "Davantage de compatibilité avec les lecteurs d'écran et tests auprès des personnes malvoyants, pour que l'application permet l'accès aux concerts à tous.",
        "conclusion2.4": "Un module de messagerie, pour permettre aux spectateurs de se faire connaissance et faire des plans avant leur rencontre sur les lieux du concert.",
        "conclusion2.5": " Après le prototype haute fidélité et les études d'usabilité terminées, je tentais d'imaginer quelques capacités supplémentaires pour une potentielle version 2.0. Il s'agit des quelques idées que j'avais eues au début de la conception de l'app."
    },

    "vanityvixen": {
        "project3": "Vanity Vixen",
        "subtitle3": "Responsive Website pour des tutoriels de maquillage et de coiffure",
        "subtitle3.1": "Projet de Portfolio UX Design",
        "theproject3": "Le Projet ",
        "theproject3.1": "Vanity Vixen est un site spécialement conçu pour les tutoriels de maquillage. Il est destiné à des usagers de tous types, peu importe le genre où le niveau de pratique. L'objectif est de proposer des looks pour le quotidien, mais également des looks plus extravagants pour des looks plus spéciaux.",
        "theproblematic3": "La Problématique ",
        "theproblematic3.1": "Il existe beaucoup de tutoriels de maquillage sur YouTube, cependant il est facile pour l'utilisateur d'être distrait où de procrastiner dû au nombre de contenu qui s'y trouve. De plus, il y manque un moyen pour l'utilisateur de voir sa progression.",
        "theobjective3": "L'Objectif ",
        "theobjective3.1": "Concevoir un site spécialisé sur les tutoriels de maquillage, qui soit convivial pour les débutants avec des ressources pour trouver des produits, une retranscription des étapes et un suivi de progression.",
        "therole3": "Mon Rôle ",
        "therole3.1": "UX designer pour la version PC et mobile du site web.",
        "responsabilities3": "Mes Responsabilités ",
        "responsabilities3.1": "Conduite des interviews, création de wireframes papier et digital, prototypes basse et haute fidélité, conduite des études d'usabilité, responsive design et prise en compte de l'accessibilité.",
    
        "userresearch3": "Recherche Utilisateur",
        "userresearch3.1": "L'étape initiale pour la création de ce prototype était une enquête utilisateur auprès de cinq personnes qui étaient susceptibles de se maquiller. Je me suis assurée d'interroger des personnes de différents niveaux et de genres différents.",
        "userresearch3.2": "Les questions d'entretien furent les suivantes :",

        "q3.1": "A quelle fréquence regardez vous des tutoriels de maquillage?",
        "q3.2": "Pourquoi vous maquillez-vous / pourquoi souhaiteriez apprendre le maquillage?",
        "q3.3": "Qu'est ce qui vous empêche d'être plus régulier avec le maquillage?",
        "q3.4": "Quel est le style de makeup que vous aimez faire / que vous souhaiteriez faire?",
        "q3.5": "S'il existait une plateforme spécialement dédiée pour les tutoriels de maquillage, quels fonctions souhaiteriez-vous y retrouver?",
    
        "results3": "Grâce aux résultats obtenus lors de ces sondages, j'ai pu identifier quatre points de douleur.",
        "r3.1": "Procrastination: Les utilisateurs peuvent manquer d'encouragement où disposent de trop de distractions pour pratiquer régulièrement.",
        "r3.2": "Produits de maquillage: Il est difficile, notamment pour les débutants de savoir quels sont les produits essentiels idéaux pour démarrer.",
        "r3.3": "Aceessibilité des tutoriels: Les tutoriels manquent souvent d'une retranscription par étapes, ainsi que de liens pour retrouver les produits utilisés.",
        "r3.4": "Communauté: Les interviewés ont exprimé le besoin d'une communauté pour partager des avis honnêtes et constructifs, sans jugement.",
    
        "personas3": "Personas",
        "usermap3": "Carte du parcours utilisateur",
        "sitemap3": "Plan du Site",
        "sitemap3.1": "Développer un plan du site avant de passer au wireframing à été une nécessité pour ce projet. Le prototype que j'allais présenter allait se concentrer sur la section “Tutoriels”, mais il me fallait trouver un moyen pour organiser tous les futurs informations. ",
    
        "wireframe3": "Wireframes Papier",
        "wireframe3.1": "Grâce à la mise au point du plan du site, j'ai pu réfléchir à différentes versions de la page d'accueil sur papier.",
        "wireframe3.2": "Je voulais quelque chose qui soit ludique à naviguer pour l'utilisateur, néanmoins gardant un focus sur l'essentiel pour l'utilisateur : les tutoriels de maquillage.",
        "wireframe3.3": "Mon prototype fut d'abord réfléchi pour une version PC, puis fut adapté pour la taille des écrans des téléphones.",

        "lowfidelity3": "Prototype basse fidélité",
        "lowfidelity3.1": "Après avoir mis au point les wireframes version papier, la migration sur un prototype basse fidélité à été simple. J'ai priorisé la simplicité d'utilisation et la clarté du site, inspirée par des sites existantes comme Sephora, Nyx où encore MAC cosmetics.",
        "lowfidelity3.2": "Pour créer mon prototype basse fidélité, j'ai d'abord essayé de voir quels sortes de liens les utilisateurs sont plus susceptibles de cliquer pour avancer ou reculer à travers un site web. Ma recherche utilisateurs en main, j'ai également fait de mon possible pour que mon prototype puisse répondre aux points de douleur / problématiques découvertes. ",
    
        "usabilitytesting3": "Tests d'Usabilité",
        "testtype3": "Type de Test ",
        "testtype3.1": "Test de navigation",
        "testplace3": "Lieu ",
        "testplace3.1": "Nice et Antibes, France",
        "testcandidates3": "Candidats ",
        "testcandidates3.1": "5 personnes",
        "testlength3": "Durée ",
        "testlength3.1": "1 heure",

        "testresults3": "Tester mon prototype basse fidélité auprès de personnes extérieurs à pu m'apporter de précieux enseignements. ",
        "testresults3.1": "Organisation de la page de tutoriel: Similairement à une recette de cuisine, il était nécessaire que je présente les produits utilisés avant les étapes de maquillage.",
        "testresults3.2": "Marques de produits: Les utilisateurs désiraient bénéficier d'informations pointues sur chaque produit: carnations, marque, prix, dévouement de la marque aux causes environnementales",
        "testresults3.3": "Inclusivité: L'objectif principal de mon projet étant l'inclusivité, il aurait fallu que je propose des tutoriels pour homme également, dès le départ",
        "testresults3.4": "Basé sur l'étude d'usabilité, j'ai pu apporter des améliorations signifiantes sur mon site web, que ce soit la version mobile où  PC. J'ai par exemple réfléchi à une palette de couleurs qui soit attrayante et une mise en avant des boutons de navigation.",
        "transition3": "Pour répondre aux besoins des utilisateurs, je me suis assurée d'ajouter les noms + carnation des produits référencés dans les vidéos de démonstration. Sur la version portable, l'onglet des produits utilisés arrive avant le tutoriel de maquillage étape par étape.",
        "uikit3": "Kit d'Interface Utilisateur",

        "highfidelity3": "Prototype Haute Fidélité (PC)",
        "highfidelity3.1": "Le flow utilisateur est resté inchangé pour ma nouvelle itération, les changements apportés furent surtout pour optimiser la facilité d'utilisation et l'aspect visuel.",
        "highfidelity3.2": "Prototype Haute Fidélité (Android)",
        "highfidelity3.3": "Travailler sur la version mobile de mon site à été une grande priorité dès le début. Je souhaitais absolument proposer une expérience d'utilisation identique, peu importe si l'accès se fait du PC où du smartphone.",

        "conclusion3": "Conclusions",
        "conclusion3.1": "Impact: Les utilisateurs ciblés pour qui je souhaitais concevoir cet application ont en majorité déclarés qu'ils souhaitaient utiliser ce genre de site, qu'ils soient de niveau totalement débutant ou confirmé.",
        "conclusion3.2": "Ce que j'ai appris: Ne pas avoir peur de laisser mes loisirs et mes goûts personnels s'exprimer à travers mes projets. Avoir toujours à l'esprit l'utilisateur et ses problématiques pour répondre adéquatement à ses besoins.",
        "conclusion3.3": "Conduire une nouvelle étude d'usabilité sur ce prototype haute fidélité, avant de potentiellement envoyer ce design à des ingénieurs.",
        "conclusion3.4": "Enrichir le site web de contenu et d'outils ludiques, permettant à l'utilisateur de mieux suivre ses progrès."
    },
    "b": {
        "1": "Plateforme de Blogging",
        "2": "Application web Full stack",
        "3": "Projet autonome",
        "4": "Cette plateforme de blogging a été conçue pour documenter mon parcours en codage, partager mes apprentissages et mes réussites, et enrichir mon expérience en développement web et en déploiement.",
        
        "5": "Fonctionnalités",
        "6": "Authentification utilisateur: La plateforme permet de créer un compte utilisateur et de se connecter de manière sécurisée grâce à un système de rafraîchissement des tokens.",
        "7": "Gestion des posts (CRUD): Les utilisateurs peuvent créer un nouvel article, le visualiser sur leur portfolio, l'éditer ultérieurement ou le supprimer. Toutes les modifications sont visibles instantanément.",
        "8": "Éditeur de texte personnalisé (Markdown): Pour la création et l'édition des articles, après avoir essayé React Quill, j'ai plutôt opté pour un simple éditeur de texte Markdown, me permettant davantage de flexibilité et de facilité d'écriture, tout en me permettant de passer moins de temps à debug.",
        "9": "Responsive design: La plateforme s'adapte automatiquement pour offrir une expérience optimale, que ce soit sur mobile ou sur ordinateur.",
        "10": "Déploiement robuste: J'ai utilisé une configuration .htaccess personnalisée pour le déploiement sur un serveur Apache, garantissant un routage fluide et des mises à jour simples.",

        "11": "Fonctionnalités Prévues",
        "12": "Tags et catégories: Pour organiser les articles et permettre aux visiteurs de filtrer les contenus selon leurs intérêts.",
        "13": "Affichage public/privé: Une fonctionnalité pour sauvegarder un brouillon et le publier ultérieurement.",
        "14": "Analytics: Suivre le nombre de visiteurs par article ou catégorie, et analyser les performances globales du blog.",
        "15": "Commentaires: Offrir aux visiteurs la possibilité de laisser des retours ou d'interagir avec l'auteur.",
        "16": "Défis rencontrés",
        "17": "Configuration du fichier .htaccess: Le routage du serveur a été particulièrement complexe. Par exemple, j'ai rencontré des écrans blancs bien que les fichiers JavaScript et HTML aient été correctement trouvés. J'ai également dû résoudre des problèmes de types MIME et configurer correctement les adresses des requêtes backend. Pour en savoir plus, vous pouvez consulter cet article détaillé.",
        "18": "Politiques CORS: J'ai implémenté une politique CORS stricte dans le backend pour sécuriser les appels API depuis le frontend. J'ai également configuré des exceptions pour autoriser les requêtes GET depuis mon portfolio.",
        "19": "Personnalisation de React Quill: J'ai essayé d'adapter l'éditeur pour ajouter des fonctionnalités, comme l'intégration de blocs de code, afin de répondre à mes besoins spécifiques. J'ai fini par le supprimer pour la remplacer par un éditeur plus minimaliste.",

        "20": "Diagramme d'Architecture",
        "21": "Un diagramme illustrant la relation entre les différentes composants de la plateforme.",
        "22": "Processus de déploiement",
        "23": "Création d'un projet frontend avec React, TypeScript et Vite.",
        "24": "Mise en place d'une API backend avec Node.js et Express.js.",
        "25": "Configuration d'un fichier .htaccess pour gérer le routage et les proxys.",
        "26": "Tests approfondis sur le serveur Apache (connexion, création d'articles, déconnexion, etc.)",
        
        "27": "Captures d'écran",

        "28": "Exemples de Code",
        "29": "Customisation de l'éditeur de texte",
        "30": "Contrôleur backend pour la création d'un nouvel article",
        "31": "Leçons apprises",
        "32": "Ce projet m'a permis de comprendre les subtilités du déploiement d'une application full-stack dans un environnement professionnel. Il m'a également appris à résoudre des problèmes complexes liés au déploiement et à la configuration des serveurs.",
        "33": "Commencer par déployer une version rudimentaire a été une approche stratégique, car cela m'a permis d'identifier les dysfonctionnements de manière ciblée tout en montrant une version fonctionnelle de l'application. Utiliser GitHub pour gérer les sauvegardes s'est avéré précieux lorsque j'ai dû restaurer des fichiers après des erreurs.",

        "34": "Conclusion",
        "35": "Au fur et à mesure que mes compétences en développement se perfectionnent, cette plateforme continuera d'évoluer. Elle répondra à mes besoins croissants et représentera une vitrine de mes compétences techniques. J'ai confiance en ce projet, car il n'est pas seulement un exercice de codage, mais une application que j'utilise activement pour documenter mon parcours et enrichir mon portfolio."
    }
}
